doc/user_guide.tex
% Created 2011-03-24 Thu 17:25
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}
\begin{document}



\title{-*- mode: org; -*-}
\author{David R. McWilliams}
\date{24 March 2011}
\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}

\begin{verbatim}
SNPDoc user guide document.  Adapted from SNPDoc_User_Guide by R.T. Guy.

created: 09-Mar-2011
modified: 23-Mar-2011
\end{verbatim}


\section{Summary}
\label{sec-1}


  SNPDoc mines several online databases to record information about single
  nucleotide polymorphisms (SNPs) and genomic positions.  There are three
  options for input: a list of SNPs in `rs' format, a list of chromosomal
  regions, or a list of chromosomal positions.  In all cases, user data in the
  file will be merged with SNPDoc output.  Output is to a tab-delimited file
  (for ease of spreadsheet import) or to an html file for browser viewing.
  Information captured by SNPDoc includes:

\begin{itemize}
\item Position
\item Chromosome (and link to NCBI)
\item Gene name, description, and aliases if the SNP is in a gene
\item Nearest upstream and downstream genes if the SNP is not in a gene
\item Risk score if the SNP is in a gene (see below for the risk algorithm)
\item Position of the nearest CpG island
\item Variation type if the SNP is in a variation region
\item SNP merge information
\item Links to the NCBI and UCSC information for the SNP
\end{itemize}
\section{Installation}
\label{sec-2}


  SNPDoc was constructed to be as self-contained as possible.  The install
  script may complain of missing modules, however.  Platform-specific
  instructions are given below for installing missing modules.
\subsection{Linux/Unix/Mac}
\label{sec-2_1}


   Download the archive file and unpack in a working directory.  Change to the
   snpdoc directory and as root enter:

   >perl installScript.pl

   By default the software will be installed in \emph{usr/local} with a link pointing
   to it in /usr/local/bin.  Type `snpdoc.pl --help' to verify operation.

   If you do not have root access, you can run snpdoc by giving the fully
   qualified path to the snpdoc.pl executable.  For example:

   >perl /home/username/path/to/snpdoc.pl <options>

   If you receive errors describing missing modules, install them using CPAN.
   For example if the module `DBI' is missing, enter as root:

   >cpan install DBI
\subsection{Windows}
\label{sec-2_2}


   If you do not have Perl installed on your machine obtain it from
   \href{http://www.activestate.com/activeperl/}{http://www.activestate.com/activeperl/}.  Once it installed, open a command
   window and change to the directory where you downloaded snpdoc and type:

   >perl installScriptMSFT.pl

   The script will create a folder called `snpdoc' in your Program Files
   directory.  Open the file `test$_{\mathrm{results}}$.txt' in the installation directory
   and check for any tests that failed.  There will be instructions for
   installing perl modules that snpdoc needs.

   You may have to add snpdoc to your command path.  Do the following:

\begin{enumerate}
\item Click Start->Control Panel
\item Click ``Switch to Classic View''
\item Double click ``System''
\item Click on the Advanced tab
\item Click Environment Variables
\item Double click on the variable Path.  This will bring up a box with contents
      that look similar to:

      C:\Perl\site\bin;C:\Perl\bin;\%SystemRoot\%\system32;\%SystemRoot\%; \ldots{}
\item Find the end of the text and append `;C:\Program Files\snpdoc\bin'
      (without the quotation marks) and click OK.
\item Click OK several more times to close the ``System'' control panel
\end{enumerate}

   You should be able to run snpdoc by typing in a command window:

   C:\my\_project\snpdoc <options>
\section{Usage}
\label{sec-3}
\subsection{General}
\label{sec-3_1}


   Running snpdoc without command line options or with the --help flag
   prints the following usage information.

   usage:
   snpdoc [options] -infile FILE, where option is one or more of:

   --help          print this help message

   --infile        input file (required)

   --search        search type; one of ``snp'', ``reg'', ``pos'' (default ``snp'')

   --outfile       output file name; if not specified it will be created
                   from the input file name.

   --wtype         type of output; one of ``text'' or ``html'' (default ``text'')

   --sep           field delimiter in the input file; currently tab and comma
                   are recognized (supply with quotes as ``\t'' or ``,'');
                   default comma

   --stamp         include a random number for use in temporary files

   --verbose       print more information to the console as snpdoc runs

   --ld            compute 5 snps with the highest r$^2$ with each snp in
                   the file (this is slow)

   --ucsc\_version set the UCSC database version; currently hg18 and hg19
                   are recognized (default 19)

   --restart       a snp designation; if given, processing will start at
                   this snp in the file

   Flags may also be given as `-h', `-s', etc., if the single letter uniquely
   specifies an option.
   
\subsection{SNP Search}
\label{sec-3_2}


   Running SNPDoc with the `--search snp' option (the default) will search a
   number of databases and aggregate this information with information supplied
   by the user (say statistics from a GWAS study).  The expected file format has
   a header line and data lines following, with the SNP in the first column.
   Only the `rs\#' format is currently allowed for the SNP designation.  Any
   further columns are retained and appended to the columns output by SNPDoc.
\subsection{Positional or Regional Search}
\label{sec-3_3}


   Running SNPDoc with the `--search reg' option performs a `regional search'.
   The expected file format has a header line and the first column with
   chromosomal regions listed as `chr2:2300-2500', for example.  The region is
   searched and any SNPs found are output in a format suitable for the `SNP'
   search described previously.  If user data is supplied for the region, this
   data will be printed for each SNP found in the region.  This may create a
   very large output file if your supplied region is large.

   Running SNPDoc with the `--search pos' option performs a `positional search'.
   The expected file format has a header line and the position description
   should be in the form `chr2:1234', for example.  User data is merged with
   results.  Risk and classification are not computed for this option.
\subsection{Summary of the Risk Score Algorithm}
\label{sec-3_4}


   SNPDoc uses a modified version of the FASTSNP algorithm (Yuan et al., 2006)
   developed by Wei Wang.  The algorithm proceeds as follows.
\subsubsection{Collect the following information for each SNP}
\label{sec-3_4_1}


\begin{itemize}
\item SNP function annoations from Ensemble
\item Transcription factor binding site information from the TFSEARCH
      \hyperref[[[www.cbrc.jp]{www.cbrc.jp}/research/db/TFSEARCH.html]] database (Akiyama, 2011).
\item Significant exonic splicing enhancer (ESE) motifs found by ESEfinder
      \hyperref[rulai.cshl.edu]{rulai.cshl.edu},(Cartegni, 2003).
\item Significant exonic splicing enhancer motifs found by RESCUE-ESE
      \hyperref[genes.mit.edu/burge-lab/rescue-ess]{genes.mit.edu/burge-lab/rescue-ess}, (Fairbrother, 2002).
\item Significant exonic splicing silencer motifs found by FAS-ESS
      \hyperref[genes.mit.edu/fas-ess]{genes.mit.edu/fas-ess}, (Wang, 2004).
\end{itemize}
\subsubsection{Examine the function for the SNP and score as follows}
\label{sec-3_4_2}
\begin{itemize}

\item If INTERGENIC then risk = 0\\
\label{sec-3_4_2_1}%
\item If STOP\_GAINED or STOP\_LOST the risk = 5\\
\label{sec-3_4_2_2}%
\item If INTRONIC\\
\label{sec-3_4_2_3}%
\begin{itemize}

\item If the TFSEARCH results are equivalent for both alleles, risk = 0, classification = "Intronic with no known function"\\
\label{sec-3_4_2_3_1}%
\item If the TFSEARCH results are not equivalent, risk = 3, classification = "Intronic enhancer"\\
\label{sec-3_4_2_3_2}%
\end{itemize} % ends low level

\item If SPLICE$_{\mathrm{SITE}}$ then risk =3 and classification = "Splice site"\\
\label{sec-3_4_2_4}%
\item If 3PRIME$_{\mathrm{UTR}}$ then\\
\label{sec-3_4_2_5}%
\begin{itemize}

\item If the TFSEARCH results are equivalent for both alleles, risk = 0, classification = "Downstream with no known function"\\
\label{sec-3_4_2_5_1}%
\item If the TFSEARCH results are not equivalent, risk = 3, classification = "Promoter/Regulatory region"\\
\label{sec-3_4_2_5_2}%
\end{itemize} % ends low level

\item If 5PRIME$_{\mathrm{UTR}}$ then proceed as for 3PRIME$_{\mathrm{UTR}}$\\
\label{sec-3_4_2_6}%
\item If UPSTREAM then\\
\label{sec-3_4_2_7}%
\begin{itemize}

\item If the TFSEARCH results are equivalent for both alleles, risk = 0, classification = "Upstream with no known function"\\
\label{sec-3_4_2_7_1}%
\item If the TFSEARCH results are not equivalent, risk = 3, classification = "Promoter/Regulatory region"\\
\label{sec-3_4_2_7_2}%
\end{itemize} % ends low level

\item If DOWNSTREAM then\\
\label{sec-3_4_2_8}%
\begin{itemize}

\item If the TFSEARCH results are equivalent for both alleles, risk = 0, classification = "Downstream with no known function"\\
\label{sec-3_4_2_8_1}%
\item If the TFSEARCH results are not equivalent, risk = 3, classification = "Promoter/Regulatory region"\\
\label{sec-3_4_2_8_2}%
\end{itemize} % ends low level

\item If SYNONYMOUS$_{\mathrm{CODING}}$ then\\
\label{sec-3_4_2_9}%
\begin{itemize}

\item If the ESE found by ESEfinder are equivalent for each allele, the ESE found by RESCUE-ESE are equivalent, and the splicing silencers found by FAS-ESE are equivalent then risk = 1 and classification = "Sense/Synonymous"\\
\label{sec-3_4_2_9_1}%
\item Otherwise risk = 3 and classification = "Sense/Synonymous; Splicing Region"\\
\label{sec-3_4_2_9_2}%
\end{itemize} % ends low level

\item If NON$_{\mathrm{SYNONYMOUS}}$$_{\mathrm{CODING}}$ then\\
\label{sec-3_4_2_10}%
\begin{itemize}

\item Get the number of SNP functions in Ensembl whos biotype is "protein coding."\\
\label{sec-3_4_2_10_1}%
\item If at least one function is of biotype protein coding then\\
\label{sec-3_4_2_10_2}%
\begin{itemize}

\item If up and down stream ESE counts equal, up and down stream RESCUEESE counts equal, and up and down stream RAS-ESE equal then risk = 4, classification = "Mis-Sense (Leading to Non-Conservative Change)."\\
\label{sec-3_4_2_10_2_1}%
\item Otherwise risk = 4, classification = "Mis-Sense (Splicing Regulation, Protein Domain Abolished)\\
\label{sec-3_4_2_10_2_2}%
\end{itemize} % ends low level

\item If no function of biotype protein coding then
\label{sec-3_4_2_10_3}%
\begin{itemize}

\item If up and down stream ESE counts equal, up and down stream RESCUEESE counts equal, and up and down stream RAS-ESE equal then risk = 3, classification = "Mis-Sense (Leading to Conservative Change)\\
\label{sec-3_4_2_10_3_1}%
\item Otherwise risk = 3, classification = "Mis-Sense (Conservative); Splicing Regulation"\\
\label{sec-3_4_2_10_3_2}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\end{itemize} % ends low level
\subsubsection{The final risk score is the maximum from the above heuristic and the classification is that associated with it}
\label{sec-3_4_3}
\section{References}
\label{sec-4}


  Richard T. Guy, Wei Wang, Miranda C. Marion, Paula S. Ramos, Timothy Howard,
  and Carl D. Langefeld, ``SNPDoc: Integrating genomic data and statistical
  results.''  [Submitted]

  Hsiang-Yu Yuan, Jen-Jie Chiou, Wen-Hsien Tseng, Chia-Hung Liu, Chuan-Kun Liu,
  Yi- Jung Lin, Hui-Hung Wang, Adam Yao, Yuan-Tsong Chen, and Chun-Nan Hsu.
  FASTSNP: an always up-to-date and extendable service for SNP function analysis
  and prioritization. Nucleic Acids Res., 1 July 2006; 34: W635 - W641.

  Akiyama, Yutaka ``TFSEARCH: Searching Transcription Factor Binding Sites'',
  Computational Biology Research Center (CBRC), AIST , Japan. (Citation
  retrieved from the website in March 2011).

  Cartegni L., Wang J., Zhu Z., Zhang M. Q., Krainer A. R.; 2003.  ESEfinder: a
  web resource to identify exonic splicing enhancers.  Nucleic Acid Research,
  2003, 31(13): 3568-3571.

  Fairbrother WG, Yeh RF, Sharp PA, Burge CB. Predictive identification of
  exonic splicing enhancers in human genes. Science. 2002 Aug
  9;297(5583):1007-13.

  Wang, Z., Rolish, M. E., Yeo, G., Tung, V., Mawson, M. and Burge,
  C. B. (2004). Systematic identification and analysis of exonic splicing
  silencers. Cell 119, 831-845.

\end{document}
